sdaiIsSubtypeOf(Sdai_instS*,Sdai_instS*)
\details
The Is Subtype Of function shall determine whether an entity definition is a subtype of another entity
definition.
\param subtype [in] subtype to check
\param supertype [in] supertype to check
\returns sdaiTRUE if supertype is supertype of subtype, in other case sdaiFALSE